import subjects.Subject;

/*
1. Создать класс Предмет, а также наследников от него (несколько) - математика, рус. язык и т.д.
Добавить несколько полей, характеризующих школьный предмет: название, продолжительность урока, сложность...
Создать массив школьных предметов.
Посчитать количетсво одинаковых предметов в массиве
Вывести о них информацию в виде - Название_предмета (параметры) - количество
 */
public class Runner {
    public static void main(String[] args) throws ClassNotFoundException {
        Subject[] array= new Subject[5];
        int[] counter = new int[3];
    }
}

